using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace _06._04._18
{
    class Program
    {
        static void Main(string[] args)
        {
            //////// 01 Գրել ֆունկցիա, որը կվերադարձնի true, եթե արգումենտում փոխանցված ամբողջ թիվը զույգ է և false՝ եթե կենտ է։
            //////// 02 Գրել ֆունկցիա, որը կվերադարձնի արգումենտում փոխանցված զանգվածը հակադարձած։
            //////// 03 Գրել ֆունկցիա, որը կվերադարձնի արգումենտում փոխանցված թվային զանգվածի ամենամեծ(ամենափոքր) էլեմենտի արժեքը։
            //////// 04 Գրել ֆունկցիա, որը կվերադարձնի արգումենտում փոխանցված թվային զանգվածի ամենամեծ(ամենափոքր) էլեմենտի ինդեքսը։
            //////// 05 Գրել ֆունկցիա, որը կվերադարձնի արգումենտում փոխանցված երկու թվային զանգվածների գումարը(արտադրյալը)։
            //////// 06 Գրել ֆունկցիա, որը արգումենտում փոխանցված թվային զանգվածը էլեմենտ առ էլեմենտ կբազմապատկի(կգումարի) արգումենտում փոխանցված թվով։
        }
    }
}
