using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Homework_26._03
{
    class Program
    {
        static void Main(string[] args)
        {
        }
    }
}

//  01. Արտածել 1-ից մինչև n բոլոր ամբողջ թվերը։
//  02. Արտածել 1-ից մինչև n բոլոր ամբողջ զույգ թվերը։
//  03. Արտածել 1-ից մինչև n բոլոր ամբողջ կենտ թվերը։
//  04. Հաշվել 1-ից մինչև n բոլոր ամբողջ թվերի գումարը և արտածել այն։
//  05. Հաշվել a-ից մինչև b բոլոր ամբողջ թվերի գումարը և արտածել այն։
//  06. Հաշվել 1-ից մինչև 15 բոլոր ամբողջ թվերի արտադրյալը և արտածել այն։
//  07. Տպել 1-999 միջակայքի այն թվերի գումարը, որոնց վրա առանց մնացորդի բաժանվում է տրված n բնական թիվը։
//  08. Տպել 1-999 միջակայքի այն թվերի արտադրյալը, որոնց վրա առանց մնացորդի բաժանվում է տրված n բնական թիվը։
//  09. Տպել 1-999 միջակայքի այն թվերի գումարը, որոնց վրա տրված n բնական թիվը բաժանելիս կմնա 2 մնացորդ։
//  10. Տպել 1-999 միջակայքի այն թվերի արտադրյալը, որոնց վրա տրված n բնական թիվը բաժանելիս կմնա 3 մնացորդ։
//  11. Տպել բոլոր երկնիշ թվերի գումարը, որոնք բազմապատիկ են 3-ի։
//  12. Տպել բոլոր երկնիշ թվերի արտադրյալը, որոնք բազմապատիկ են 3-ի և 5-ի։
//  13. Տպել բոլոր եռանիշ թվերի արտադրյալը, որոնց բազմապատիկ չեն 5-ի։
//  14. Տպել բոլոր եռանիշ թվերի արտադրյալը, որոնց բազմապատիկ չեն 2-ի և 3-ի։
//  15. Տպել բոլոր եռանիշ թվերի արտադրյալը, որոնք 3-ի բաժանելիս կմնա 1 մնացորդ, իսկ 4-ի բաժանելիս՝ 2 մնացորդ։
//  16. Տպել ամենափոքր եռանիշ թիվը, որը 16-ով բազմապատկելիս դառնում է բնական թվի քառակուսի։
//  17. Տպել ամենափոքր քառանիշ թիվը, որը 26-ով բազմապատկելիս դառնում է բնական թվի քառակուսի։
//  18. Տպել ամենամեծ քառանիշ թիվը, որը 14-ով բազմապատկելիս դառնում է բնական թվի քառակուսի։
//  19. Տպել ամենամեծ քառանիշ թիվը, որը 18-ով բազմապատկելիս դառնում է բնական թվի քառակուսի։
//  20. Տպել ամենափոքր եռանիշ թիվը, որի քառակուսի արմատը մեծ է տրված n բնական թվից։
