using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Homework_04._04._18
{
    class Program
    {
        static void Main(string[] args)
        {
            ////// 01 Ստեղծել երկչափ զանգված, որը կպարունակի 1 - 9 թվերի բազմապատկման աղյուսակը։
            ////// 02 Ստեղծել երկչափ քառակուսաձև զանգված, որի անկյունագծի էլեմենտները հավասար կլինեն 1 - ի, իսկ մնացածները՝ 0 - ի։
            ////// 03 Ստեղծել երկչափ քառակուսաձև զանգված, որի զույգ համարով տողերի էլեմենտները հավասար կլինեն 1 - ի, իսկ կենտերը՝ 0 - ի։
            ////// 04 Ստեղծել երկչափ քառակուսաձև զանգված, որի էլեմենտները հավասար կլինեն 1 - ի, եթե էլեմենտի ինդեքսների գումարը զույգ է, իսկ մնացածները՝ 0 - ի։

            //////  Տրված են m ամբողջ թիվը և m x m չափի զանգված, որի տարրերը բնական թվեր են, հաշվել` 

            ////// 05 գլխավոր անկյունակծից ներքև գտնվող թվերի քանակը, որոնք բաժանվում են տրված k թվին
            ////// 06  գլխավոր անկյունագծից ներքև գտնվող տարրերի միջին թվաբանականը, որոնք բազմապատիկ են 5 - ի և դրանց քանակը
            ////// 07 գլխավոր անկյունագծից ներքև կամ դրա վրա գտնվող այն զույգ արժեք ունեցող տարրերի միջին թվաբանականը
            ////// 08 գլխավոր անկյունագծից ներքև գտնվող զույգ տարրերի քանակը
            ////// 09 օժանդակ անկյունագծի վրա, կամ դրանից վերև գտնվող զրո արժեք ունեցող տարրերի քանակը
            ////// 10 օժանդակ անկյունագծից ներքև կամ դրա վրա գտնվող տարրերի քանակը, որոնց ինդեքսների գումարը կենտ է
            ////// 11 օժանդակ անկյունագծից վերև, կամ նրա դրա գտնվող այն տարրերի միջին քառակուսայինը, որոնց ինդեքսների գումարը կենտ է

            ////// 12

            Տրված են m ամբողջ թիվը և m x m չափի զանգված(մատրից) , որի տարրերը բնական թվեր են,
            //////        հաշվել զանվածի անկյունակծից ներքև, կամ նրա վրա գտնվող կենտ թվերի միջին թվաբանականը
        }
    }
}
