using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Homework_30._03
{
    class Program
    {
        static void Main(string[] args)
        {
            //Ստեղծել զանգված, որի էլեմենտները կպարունակեն 1-ից մինչև n ամբողջ թվերի քառակուսիները։
            // Հաշվե թվային զանգվածի էլեմենտների գումարը։
            //Հաշվել թվային զանգվածի էլեմենտների արտադրյալը։
            //Գտնել թվային զանգվածի էլեմենտներից փոքրագույնը։
            //Գտնել թվային զանգվածի էլեմենտներից մեծագույնը։
            //Գրել ծրագիր, որը կպատճենի a զանգվածը b զանգվածի մեջ։
            //Գրել ծրագիր, որը կհակադարձի զանգվածը։
            //Գրել ծրագիր, որը կգումարի էլեմենտ առ էլեմենտ a և b զանգվածները և արդյունքը կպահի c զանգվածի մեջ։
            //Գրել ծրագիր, որը կբազմապատկի էլեմենտ առ էլեմենտ a և b զանգվածները և արդյունքը կպահի c զանգվածի մեջ։
        }
    }
}
